quadcopter/cfd/propeller_case/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
  version:     2.0;
  format:      ascii;
  class:       dictionary;
  object:      surfaceFeatureExtractDict;
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

propeller.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    geometricTestOnly   no;
    writeObj            yes;
}
